a = int(input("Введите число 'a': "))
b = int(input("Введите число 'b': "))
print("Сумма чисел а и b равна", a + b)
print("Разность чисел а и b равна", a - b)
print("Произведение чисел а и b равна", a * b)
print("Результат возведения числа а в степень b равен", a**b)
print("Результат деления по модулю чисел а и b равен", a % b)
print("Результат целочисленного деления чисел а и b равен", a // b)

x = (((17 / 2) * 3) + 2)
x = (2 + ((17 / 2) * 3))
x = ((19 % 4) + ((15 / 2) * 3))
x = ((15 + 6) - (10 * 4))
x = (((17 / 2) % 2) * (3**3))

x = int(input("Введите число 'x': "))
y = int(input("Введите число 'y': "))
rez = (abs(x)-abs(y)) / (1 + abs(x * y))
print(rez)



